import unittest
from scrape import get_street

class GetStreetTest(unittest.TestCase):
    def test_normal(self):
        self.assertEqual(get_street('Ενοικιάζεται  Γκαρσονιέρα  στην οδό  Καλούδη 11, περιοχή  Κέντρο. Διαθέσιμο από  19/06/2015. Πληροφορίες τηλέφωνο:  6972691551'), 'Καλούδη 11')
        self.assertEqual(get_street('Ενοικιάζεται Γκαρσονιέρα 28 τ.μ. στην οδό Δωδώνης 145. Επιπλωμένες με αυτόνομη θέρμανση (2 γκαρσονιέρες). Διαθέσιμο από 01/07/2015. Πληροφορίες τηλέφωνο: 2651068384 & 2651041259 & 6948597230'), 'Δωδώνης 145')

    def test_multiname(self):
        self.assertEqual(get_street('Ενοικιάζεται διαμέρισμα 74 τ.μ. στο ισόγειο στην οδό Καπετάν Λεπενιώτη 2, περιοχή Δροσιά - Φρόντζου Πολιτεία. Αυτόνομη θέρμανση με κήπο και parking χωρίς κοινόχρηστα. Διαθέσιμο από 23/04/2015. Πληροφορίες τηλέφωνο: 6979982084,2651045522'), 'Καπετάν Λεπενιώτη 2')

    def test_street_with_number(self):
        self.assertEqual(get_street('Ενοικιάζεται Γκαρσονιέρα 38 τ.μ. στον δεύτερο όροφο στην οδό 4η Πάροδος Κωνσταντινουπόλεως 5, περιοχή Ανατολή. Δίχωρη, σε νεόδμητη οικοδομή με κεντρική θέρμανση χωρίς κοινόχρηστα. Διαθέσιμο από 11/06/2015. Πληροφορίες τηλέφωνο: 6946945845'), '4η Πάροδος Κωνσταντινουπόλεως 5')
        self.assertEqual(get_street('Ενοικιάζεται Γκαρσονιέρα 30 τ.μ. στο ισόγειο στην οδό 3ης Σεπτεμβρίου 48, περιοχή Ανατολή. Studio φοιτητητικό,πλήρως εξοπλισμένο, αυτόνομη θέρμανση, χωρίς κοινόχρηστα . Διαθέσιμο από 30/06/2015. Πληροφορίες τηλέφωνο: 2651047792, 6932057820'), '3ης Σεπτεμβρίου 48')

    def test_street_number_range(self):
        self.assertEqual(get_street('Ενοικιάζεται Γκαρσονιέρα στον πρώτο όροφο στην οδό Γρίβα 11-13. Δίχωρη. Διαθέσιμο από 08/06/2015. Πληροφορίες τηλέφωνο: 6946892507, 210 9326602'), 'Γρίβα 11-13')

    def test_dot_cutoff(self):
        self.assertEqual(get_street('Ενοικιάζεται διαμέρισμα Τριάρι 77 τ.μ. στον πρώτο όροφο στην οδό Χρ. Πρέντζα 3, περιοχή Πλατανάκια. Αυτόνομη θέρμανση, χωρίς κοινόχρηστα. Διαθέσιμο από 13/05/2015. Πληροφορίες τηλέφωνο: 26510-47427 & 6937472228 & 6955412472'), 'Χρ. Πρέντζα 3')
        self.assertEqual(get_street('Ενοικιάζεται  Γκαρσονιέρα  23  τ.μ.  στο ισόγειο     στην οδό  Αριστοτέλους 26Α και Κ. Παλαιολόγου, περιοχή  Ανατολή.   Στούντιο σε νεόχτηση οικοδομή με αυτόνομη θέρμανση χωρίς κοινόχρηστα, επιπλωμένο. Διαθέσιμο από  03/06/2015. Πληροφορίες τηλέφωνο:  6942834373'), 'Αριστοτέλους 26Α')

    def test_no_number(self):
        self.assertEqual(get_street('Ενοικιάζεται Γκαρσονιέρα 40 τ.μ. στον πρώτο όροφο για φοιτητές/τριες στην οδό Ανεξαρτησίας, περιοχή Κέντρο. Δίχωρη γκαρσονιέρα, με αυτόνομη θέρμανση, σε νεόδμητη οικοδομή σε άριστη κατάσταση με λίγα κοινόχρησ. Διαθέσιμο από 30/06/2015. Πληροφορίες τηλέφωνο: 6944368263'), 'Ανεξαρτησίας')
        self.assertEqual(get_street('Ενοικιάζεται Γκαρσονιέρα 40 τ.μ. στον πρώτο όροφο για φοιτητές/τριες στην οδό Ανεξαρτησίας. Περιοχή Κέντρο. Δίχωρη γκαρσονιέρα, με αυτόνομη θέρμανση, σε νεόδμητη οικοδομή σε άριστη κατάσταση με λίγα κοινόχρησ. Διαθέσιμο από 30/06/2015. Πληροφορίες τηλέφωνο: 6944368263'), 'Ανεξαρτησίας')

    def test_and(self):
        self.assertEqual(get_street('Ενοικιάζεται Γκαρσονιέρα 37 τ.μ. στον πρώτο όροφο στην οδό Νικολίδη & Παπανδρέου, περιοχή Απέναντι απο Υπεραστικό ΚΤΕΛ Ιωαννίνων. Δίχωρη πρόσφατα ανακαινισμένη. Διαθέσιμο από 19/06/2015. Πληροφορίες τηλέφωνο: 6971598615'), 'Νικολίδη & Παπανδρέου')

    def test_none(self):
        self.assertEqual(get_street('Ενοικιάζεται Γκαρσονιέρα 30 τ.μ. στον τρίτο όροφο για φοιτητές/τριες , περιοχή Πίσω από το Gran Serai. Δίχωρη, γωνιακή, νεόδμητη, αυτόνομη θέρμανση, . Διαθέσιμο από 16/06/2015. Πληροφορίες τηλέφωνο: 6974075781'), None)

if __name__ == '__main__':
    unittest.main()
